---
type: ExportPatternKey
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# ExportPatternKey

`Autodesk.Revit.DB.ExportPatternKey` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ExportPatternKey | — | `` |
| Constructor | ExportPatternKey | 2014 | `public ExportPatternKey ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | OriginalFillPatternName | 2014 | `public string OriginalFillPatternName { get ; set ; }` |
| Property | OriginalFillPatternType | 2014 | `public FillPatternTarget OriginalFillPatternType { get ; set ; }` |